Revit 2025 API
OverridePermissions Enumeration
 Types of overrides that can be applied to a category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum OverridePermissions
Public Enumeration OverridePermissions
public enum class OverridePermissions
type OverridePermissions
Members
Member name | Value | Description
ViewDetailLevel | 1 |  View detail level
Halftone | 2 |  Halftone
CutLines | 3 |  Cut lines
CutFills | 4 |  Cut fills
ProjectionLines | 5 |  Projection lines
ProjectionFills | 6 |  Projection fills
Surfaces | 7 |  Surface transparency
See Also
Reference
Autodesk.Revit.DB Namespace